# 初期化手順

## Ciscoルータの場合

ルータ名を「RT01」とする。

1. 初期化コマンドの入力
   
   以下のコマンドを入力してルータの設定を初期化する。<br>
   ```
   RT01# erase startup-config
   ・・・
   ・・・
   RT01# reload
   ```
## Catalystスイッチの場合

スイッチ名を「SW01」とする。<br>
完全に初期化するためには、NVRAM上のコンフィグの削除だけでなくフラッシュメモリ上にあるVLAN情報である```vlan.dat```というファイルも削除する必要がある。

1. 初期化コマンドの入力
   
   以下のコマンドを入力してスイッチの設定を初期化する。<br>
   ```
   SW01# show flash:
   ・・・
   ・・・
   SW01# erase startup-config
   ・・・
   ・・・
   SW01# delete flash:vlan.dat
   ・・・
   ・・・
   SW01# reload
   ```
